---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArc.GetConstraints
source: html/0adcf75b-22dd-9672-68a7-9cec782759f5.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeDefinitionByArc.GetConstraints Method

Retrieve the list of constraints associated with this definition.

## Syntax (C#)
```csharp
public IList<RebarShapeConstraint> GetConstraints()
```

## Returns
The list of constraints.